espressif/esp-idf/components/soc/esp32c6/register/soc/extmem_struct.h
/**
 * SPDX-FileCopyrightText: 2025-2026 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Control and configuration registers */
/** Type of l1_icache_ctrl register
 *  L1 instruction Cache(L1-ICache) control register
 */
typedef union {
    struct {
        /** l1_icache_shut_ibus0 : HRO; bitpos: [0]; default: 0;
         *  The bit is used to disable core0 ibus access L1-ICache, 0: enable, 1: disable
         */
        uint32_t l1_icache_shut_ibus0:1;
        /** l1_icache_shut_ibus1 : HRO; bitpos: [1]; default: 0;
         *  The bit is used to disable core1 ibus access L1-ICache, 0: enable, 1: disable
         */
        uint32_t l1_icache_shut_ibus1:1;
        /** l1_icache_shut_ibus2 : HRO; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache_shut_ibus2:1;
        /** l1_icache_shut_ibus3 : HRO; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache_shut_ibus3:1;
        /** l1_icache_undef_op : HRO; bitpos: [7:4]; default: 0;
         *  Internal debug control field.
         *  bits[1:0]: Arbitration mode.
         *    0: Round-robin, hold bus until data fetch completes.
         *    1: Round-robin, release bus after request is issued.
         *    2/3: Random arbitration.
         */
        uint32_t l1_icache_undef_op:4;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} extmem_l1_icache_ctrl_reg_t;

/** Type of l1_cache_ctrl register
 *  L1 data Cache(L1-Cache) control register
 */
typedef union {
    struct {
        /** l1_cache_shut_bus0 : R/W; bitpos: [0]; default: 0;
         *  The bit is used to disable core0 dbus access L1-Cache, 0: enable, 1: disable
         */
        uint32_t l1_cache_shut_bus0:1;
        /** l1_cache_shut_bus1 : R/W; bitpos: [1]; default: 0;
         *  The bit is used to disable core1 dbus access L1-Cache, 0: enable, 1: disable
         */
        uint32_t l1_cache_shut_bus1:1;
        /** l1_cache_shut_dbus2 : HRO; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_cache_shut_dbus2:1;
        /** l1_cache_shut_dbus3 : HRO; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t l1_cache_shut_dbus3:1;
        /** l1_cache_shut_dma : HRO; bitpos: [4]; default: 0;
         *  The bit is used to disable DMA access L1-Cache, 0: enable, 1: disable
         */
        uint32_t l1_cache_shut_dma:1;
        uint32_t reserved_5:3;
        /** l1_cache_undef_op : R/W; bitpos: [11:8]; default: 0;
         *  Internal debug control field.
         *  bits[1:0]: Arbitration mode.
         *    0: Round-robin, hold bus until data fetch completes.
         *    1: Round-robin, release bus after request is issued.
         *    2/3: Random arbitration.
         */
        uint32_t l1_cache_undef_op:4;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} extmem_l1_cache_ctrl_reg_t;

/** Type of l2_cache_ctrl register
 *  L2 Cache(L2-Cache) control register
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** l2_cache_shut_dma : HRO; bitpos: [4]; default: 0;
         *  The bit is used to disable DMA access L2-Cache, 0: enable, 1: disable
         */
        uint32_t l2_cache_shut_dma:1;
        /** l2_cache_undef_op : HRO; bitpos: [8:5]; default: 0;
         *  Internal debug control field.
         *  bits[1:0]: Arbitration mode.
         *    0: Round-robin, hold bus until data fetch completes.
         *    1: Round-robin, release bus after request is issued.
         *    2/3: Random arbitration.
         */
        uint32_t l2_cache_undef_op:4;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} extmem_l2_cache_ctrl_reg_t;


/** Group: Bypass Cache Control and configuration registers */
/** Type of l1_bypass_cache_conf register
 *  Bypass Cache configure register
 */
typedef union {
    struct {
        /** bypass_l1_icache0_en : HRO; bitpos: [0]; default: 0;
         *  The bit is used to enable bypass L1-ICache0. 0: disable bypass, 1: enable bypass.
         */
        uint32_t bypass_l1_icache0_en:1;
        /** bypass_l1_icache1_en : HRO; bitpos: [1]; default: 0;
         *  The bit is used to enable bypass L1-ICache1. 0: disable bypass, 1: enable bypass.
         */
        uint32_t bypass_l1_icache1_en:1;
        /** bypass_l1_icache2_en : HRO; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t bypass_l1_icache2_en:1;
        /** bypass_l1_icache3_en : HRO; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t bypass_l1_icache3_en:1;
        /** bypass_l1_dcache_en : HRO; bitpos: [4]; default: 0;
         *  The bit is used to enable bypass L1-DCache. 0: disable bypass, 1: enable bypass.
         */
        uint32_t bypass_l1_dcache_en:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} extmem_l1_bypass_cache_conf_reg_t;

/** Type of l2_bypass_cache_conf register
 *  Bypass Cache configure register
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** bypass_l2_cache_en : HRO; bitpos: [5]; default: 0;
         *  The bit is used to enable bypass L2-Cache. 0: disable bypass, 1: enable bypass.
         */
        uint32_t bypass_l2_cache_en:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} extmem_l2_bypass_cache_conf_reg_t;


/** Group: Cache Atomic Control and configuration registers */
/** Type of l1_cache_atomic_conf register
 *  L1 Cache atomic feature configure register
 */
typedef union {
    struct {
        /** l1_cache_atomic_en : HRO; bitpos: [0]; default: 0;
         *  The bit is used to enable atomic feature on L1-Cache when multiple cores access
         *  L1-Cache.  1: disable, 1: enable.
         */
        uint32_t l1_cache_atomic_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} extmem_l1_cache_atomic_conf_reg_t;


/** Group: Cache Mode Control and configuration registers */
/** Type of l1_icache_cachesize_conf register
 *  L1 instruction Cache CacheSize mode configure register
 */
typedef union {
    struct {
        /** l1_icache_cachesize_1k : HRO; bitpos: [0]; default: 0;
         *  The field is used to configure cachesize of L1-ICache as 1k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_icache_cachesize_1k:1;
        /** l1_icache_cachesize_2k : HRO; bitpos: [1]; default: 0;
         *  The field is used to configure cachesize of L1-ICache as 2k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_icache_cachesize_2k:1;
        /** l1_icache_cachesize_4k : HRO; bitpos: [2]; default: 0;
         *  The field is used to configure cachesize of L1-ICache as 4k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_icache_cachesize_4k:1;
        /** l1_icache_cachesize_8k : HRO; bitpos: [3]; default: 0;
         *  The field is used to configure cachesize of L1-ICache as 8k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_icache_cachesize_8k:1;
        /** l1_icache_cachesize_16k : HRO; bitpos: [4]; default: 0;
         *  The field is used to configure cachesize of L1-ICache as 16k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_icache_cachesize_16k:1;
        /** l1_icache_cachesize_32k : HRO; bitpos: [5]; default: 0;
         *  The field is used to configure cachesize of L1-ICache as 32k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_icache_cachesize_32k:1;
        /** l1_icache_cachesize_64k : HRO; bitpos: [6]; default: 0;
         *  The field is used to configure cachesize of L1-ICache as 64k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_icache_cachesize_64k:1;
        /** l1_icache_cachesize_128k : HRO; bitpos: [7]; default: 0;
         *  The field is used to configure cachesize of L1-ICache as 128k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_icache_cachesize_128k:1;
        /** l1_icache_cachesize_256k : HRO; bitpos: [8]; default: 0;
         *  The field is used to configure cachesize of L1-ICache as 256k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_icache_cachesize_256k:1;
        /** l1_icache_cachesize_512k : HRO; bitpos: [9]; default: 0;
         *  The field is used to configure cachesize of L1-ICache as 512k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_icache_cachesize_512k:1;
        /** l1_icache_cachesize_1024k : HRO; bitpos: [10]; default: 0;
         *  The field is used to configure cachesize of L1-ICache as 1024k bytes. This field
         *  and all other fields within this register is onehot.
         */
        uint32_t l1_icache_cachesize_1024k:1;
        /** l1_icache_cachesize_2048k : HRO; bitpos: [11]; default: 0;
         *  The field is used to configure cachesize of L1-ICache as 2048k bytes. This field
         *  and all other fields within this register is onehot.
         */
        uint32_t l1_icache_cachesize_2048k:1;
        /** l1_icache_cachesize_4096k : HRO; bitpos: [12]; default: 0;
         *  The field is used to configure cachesize of L1-ICache as 4096k bytes. This field
         *  and all other fields within this register is onehot.
         */
        uint32_t l1_icache_cachesize_4096k:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} extmem_l1_icache_cachesize_conf_reg_t;

/** Type of l1_icache_blocksize_conf register
 *  L1 instruction Cache BlockSize mode configure register
 */
typedef union {
    struct {
        /** l1_icache_blocksize_8 : HRO; bitpos: [0]; default: 0;
         *  The field is used to configureblocksize of L1-ICache as 8 bytes. This field and all
         *  other fields within this register is onehot.
         */
        uint32_t l1_icache_blocksize_8:1;
        /** l1_icache_blocksize_16 : HRO; bitpos: [1]; default: 0;
         *  The field is used to configureblocksize of L1-ICache as 16 bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_icache_blocksize_16:1;
        /** l1_icache_blocksize_32 : HRO; bitpos: [2]; default: 0;
         *  The field is used to configureblocksize of L1-ICache as 32 bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_icache_blocksize_32:1;
        /** l1_icache_blocksize_64 : HRO; bitpos: [3]; default: 0;
         *  The field is used to configureblocksize of L1-ICache as 64 bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_icache_blocksize_64:1;
        /** l1_icache_blocksize_128 : HRO; bitpos: [4]; default: 0;
         *  The field is used to configureblocksize of L1-ICache as 128 bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_icache_blocksize_128:1;
        /** l1_icache_blocksize_256 : HRO; bitpos: [5]; default: 0;
         *  The field is used to configureblocksize of L1-ICache as 256 bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_icache_blocksize_256:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} extmem_l1_icache_blocksize_conf_reg_t;

/** Type of l1_cache_cachesize_conf register
 *  L1 data Cache CacheSize mode configure register
 */
typedef union {
    struct {
        /** l1_cache_cachesize_1k : HRO; bitpos: [0]; default: 0;
         *  The field is used to configure cachesize of L1-Cache as 1k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_cache_cachesize_1k:1;
        /** l1_cache_cachesize_2k : HRO; bitpos: [1]; default: 0;
         *  The field is used to configure cachesize of L1-Cache as 2k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_cache_cachesize_2k:1;
        /** l1_cache_cachesize_4k : HRO; bitpos: [2]; default: 0;
         *  The field is used to configure cachesize of L1-Cache as 4k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_cache_cachesize_4k:1;
        /** l1_cache_cachesize_8k : HRO; bitpos: [3]; default: 0;
         *  The field is used to configure cachesize of L1-Cache as 8k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_cache_cachesize_8k:1;
        /** l1_cache_cachesize_16k : HRO; bitpos: [4]; default: 0;
         *  The field is used to configure cachesize of L1-Cache as 16k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_cache_cachesize_16k:1;
        /** l1_cache_cachesize_32k : HRO; bitpos: [5]; default: 1;
         *  The field is used to configure cachesize of L1-Cache as 32k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_cache_cachesize_32k:1;
        /** l1_cache_cachesize_64k : HRO; bitpos: [6]; default: 0;
         *  The field is used to configure cachesize of L1-Cache as 64k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_cache_cachesize_64k:1;
        /** l1_cache_cachesize_128k : HRO; bitpos: [7]; default: 0;
         *  The field is used to configure cachesize of L1-Cache as 128k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_cache_cachesize_128k:1;
        /** l1_cache_cachesize_256k : HRO; bitpos: [8]; default: 0;
         *  The field is used to configure cachesize of L1-Cache as 256k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_cache_cachesize_256k:1;
        /** l1_cache_cachesize_512k : HRO; bitpos: [9]; default: 0;
         *  The field is used to configure cachesize of L1-Cache as 512k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_cache_cachesize_512k:1;
        /** l1_cache_cachesize_1024k : HRO; bitpos: [10]; default: 0;
         *  The field is used to configure cachesize of L1-Cache as 1024k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_cache_cachesize_1024k:1;
        /** l1_cache_cachesize_2048k : HRO; bitpos: [11]; default: 0;
         *  The field is used to configure cachesize of L1-Cache as 2048k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_cache_cachesize_2048k:1;
        /** l1_cache_cachesize_4096k : HRO; bitpos: [12]; default: 0;
         *  The field is used to configure cachesize of L1-Cache as 4096k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_cache_cachesize_4096k:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} extmem_l1_cache_cachesize_conf_reg_t;

