espressif/esp-idf/components/soc/esp32c6/register/soc/extmem_struct.h
/** Group: Autoload buffer clear control and configuration registers */
/** Type of l1_cache_autoload_buf_clr_ctrl register
 *  Cache Autoload buffer clear control register
 */
typedef union {
    struct {
        /** l1_icache0_ald_buf_clr : HRO; bitpos: [0]; default: 0;
         *  set this bit to clear autoload-buffer inside L1-ICache0. If this bit is active,
         *  autoload will not work in L1-ICache0. This bit should not be active when autoload
         *  works in L1-ICache0.
         */
        uint32_t l1_icache0_ald_buf_clr:1;
        /** l1_icache1_ald_buf_clr : HRO; bitpos: [1]; default: 0;
         *  set this bit to clear autoload-buffer inside L1-ICache1. If this bit is active,
         *  autoload will not work in L1-ICache1. This bit should not be active when autoload
         *  works in L1-ICache1.
         */
        uint32_t l1_icache1_ald_buf_clr:1;
        /** l1_icache2_ald_buf_clr : HRO; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_ald_buf_clr:1;
        /** l1_icache3_ald_buf_clr : HRO; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache3_ald_buf_clr:1;
        /** l1_cache_ald_buf_clr : R/W; bitpos: [4]; default: 0;
         *  set this bit to clear autoload-buffer inside L1-Cache. If this bit is active,
         *  autoload will not work in L1-Cache. This bit should not be active when autoload
         *  works in L1-Cache.
         */
        uint32_t l1_cache_ald_buf_clr:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} extmem_l1_cache_autoload_buf_clr_ctrl_reg_t;

/** Type of l2_cache_autoload_buf_clr_ctrl register
 *  Cache Autoload buffer clear control register
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** l2_cache_ald_buf_clr : HRO; bitpos: [5]; default: 0;
         *  set this bit to clear autoload-buffer inside L2-Cache. If this bit is active,
         *  autoload will not work in L2-Cache. This bit should not be active when autoload
         *  works in L2-Cache.
         */
        uint32_t l2_cache_ald_buf_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} extmem_l2_cache_autoload_buf_clr_ctrl_reg_t;


/** Group: Unallocate request buffer clear registers */
/** Type of l1_unallocate_buffer_clear register
 *  Unallocate request buffer clear registers
 */
typedef union {
    struct {
        /** l1_icache0_unalloc_clr : HRO; bitpos: [0]; default: 0;
         *  The bit is used to clear the unallocate request buffer of l1 icache0 where the
         *  unallocate request is responded but not completed.
         */
        uint32_t l1_icache0_unalloc_clr:1;
        /** l1_icache1_unalloc_clr : HRO; bitpos: [1]; default: 0;
         *  The bit is used to clear the unallocate request buffer of l1 icache1 where the
         *  unallocate request is responded but not completed.
         */
        uint32_t l1_icache1_unalloc_clr:1;
        /** l1_icache2_unalloc_clr : HRO; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_unalloc_clr:1;
        /** l1_icache3_unalloc_clr : HRO; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache3_unalloc_clr:1;
        /** l1_cache_unalloc_clr : R/W; bitpos: [4]; default: 0;
         *  The bit is used to clear the unallocate request buffer of l1 cache where the
         *  unallocate request is responded but not completed.
         */
        uint32_t l1_cache_unalloc_clr:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} extmem_l1_unallocate_buffer_clear_reg_t;

/** Type of l2_unallocate_buffer_clear register
 *  Unallocate request buffer clear registers
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** l2_cache_unalloc_clr : HRO; bitpos: [5]; default: 0;
         *  The bit is used to clear the unallocate request buffer of l2 icache where the
         *  unallocate request is responded but not completed.
         */
        uint32_t l2_cache_unalloc_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} extmem_l2_unallocate_buffer_clear_reg_t;


/** Group: Tag and Data Memory Access Control and configuration register */
/** Type of l1_cache_object_ctrl register
 *  Cache Tag and Data memory Object control register
 */
typedef union {
    struct {
        /** l1_icache0_tag_object : HRO; bitpos: [0]; default: 0;
         *  Set this bit to set L1-ICache0 tag memory as object. This bit should be onehot with
         *  the others fields inside this register.
         */
        uint32_t l1_icache0_tag_object:1;
        /** l1_icache1_tag_object : HRO; bitpos: [1]; default: 0;
         *  Set this bit to set L1-ICache1 tag memory as object. This bit should be onehot with
         *  the others fields inside this register.
         */
        uint32_t l1_icache1_tag_object:1;
        /** l1_icache2_tag_object : HRO; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_tag_object:1;
        /** l1_icache3_tag_object : HRO; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache3_tag_object:1;
        /** l1_cache_tag_object : R/W; bitpos: [4]; default: 0;
         *  Set this bit to set L1-Cache tag memory as object. This bit should be onehot with
         *  the others fields inside this register.
         */
        uint32_t l1_cache_tag_object:1;
        uint32_t reserved_5:1;
        /** l1_icache0_mem_object : HRO; bitpos: [6]; default: 0;
         *  Set this bit to set L1-ICache0 data memory as object. This bit should be onehot
         *  with the others fields inside this register.
         */
        uint32_t l1_icache0_mem_object:1;
        /** l1_icache1_mem_object : HRO; bitpos: [7]; default: 0;
         *  Set this bit to set L1-ICache1 data memory as object. This bit should be onehot
         *  with the others fields inside this register.
         */
        uint32_t l1_icache1_mem_object:1;
        /** l1_icache2_mem_object : HRO; bitpos: [8]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_mem_object:1;
        /** l1_icache3_mem_object : HRO; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache3_mem_object:1;
        /** l1_cache_mem_object : R/W; bitpos: [10]; default: 0;
         *  Set this bit to set L1-Cache data memory as object. This bit should be onehot with
         *  the others fields inside this register.
         */
        uint32_t l1_cache_mem_object:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} extmem_l1_cache_object_ctrl_reg_t;

/** Type of l1_cache_way_object register
 *  Cache Tag and Data memory way register
 */
typedef union {
    struct {
        /** l1_cache_way_object : R/W; bitpos: [2:0]; default: 0;
         *  Set this bits to select which way of the tag-object will be accessed. 0: way0, 1:
         *  way1, 2: way2, 3: way3, ?, 7: way7.
         */
        uint32_t l1_cache_way_object:3;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} extmem_l1_cache_way_object_reg_t;

/** Type of l1_cache_vaddr register
 *  Cache Vaddr register
 */
typedef union {
    struct {
        /** l1_cache_vaddr : R/W; bitpos: [31:0]; default: 1073741824;
         *  Those bits stores the virtual address which will decide where inside the specified
         *  tag memory object will be accessed.
         */
        uint32_t l1_cache_vaddr:32;
    };
    uint32_t val;
} extmem_l1_cache_vaddr_reg_t;

/** Type of l1_cache_debug_bus register
 *  Cache Tag/data memory content register
 */
typedef union {
    struct {
        /** l1_cache_debug_bus : R/W; bitpos: [31:0]; default: 596;
         *  This is a constant place where we can write data to or read data from the tag/data
         *  memory on the specified cache.
         */
        uint32_t l1_cache_debug_bus:32;
    };
    uint32_t val;
} extmem_l1_cache_debug_bus_reg_t;

/** Type of l2_cache_object_ctrl register
 *  Cache Tag and Data memory Object control register
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** l2_cache_tag_object : HRO; bitpos: [5]; default: 0;
         *  Set this bit to set L2-Cache tag memory as object. This bit should be onehot with
         *  the others fields inside this register.
         */
        uint32_t l2_cache_tag_object:1;
        uint32_t reserved_6:5;
        /** l2_cache_mem_object : HRO; bitpos: [11]; default: 0;
         *  Set this bit to set L2-Cache data memory as object. This bit should be onehot with
         *  the others fields inside this register.
         */
        uint32_t l2_cache_mem_object:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} extmem_l2_cache_object_ctrl_reg_t;

