espressif/esp-idf/components/soc/esp32c6/register/soc/extmem_struct.h
/** Type of l2_cache_way_object register
 *  Cache Tag and Data memory way register
 */
typedef union {
    struct {
        /** l2_cache_way_object : HRO; bitpos: [2:0]; default: 0;
         *  Set this bits to select which way of the tag-object will be accessed. 0: way0, 1:
         *  way1, 2: way2, 3: way3, ?, 7: way7.
         */
        uint32_t l2_cache_way_object:3;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} extmem_l2_cache_way_object_reg_t;

/** Type of l2_cache_vaddr register
 *  Cache Vaddr register
 */
typedef union {
    struct {
        /** l2_cache_vaddr : HRO; bitpos: [31:0]; default: 1073741824;
         *  Those bits stores the virtual address which will decide where inside the specified
         *  tag memory object will be accessed.
         */
        uint32_t l2_cache_vaddr:32;
    };
    uint32_t val;
} extmem_l2_cache_vaddr_reg_t;

/** Type of l2_cache_debug_bus register
 *  Cache Tag/data memory content register
 */
typedef union {
    struct {
        /** l2_cache_debug_bus : HRO; bitpos: [31:0]; default: 932;
         *  This is a constant place where we can write data to or read data from the tag/data
         *  memory on the specified cache.
         */
        uint32_t l2_cache_debug_bus:32;
    };
    uint32_t val;
} extmem_l2_cache_debug_bus_reg_t;


/** Group: Split L1 and L2 registers */
/** Type of level_split0 register
 *  USED TO SPLIT L1 CACHE AND L2 CACHE
 */
typedef union {
    struct {
        /** level_split0 : HRO; bitpos: [31:0]; default: 600;
         *  Reserved
         */
        uint32_t level_split0:32;
    };
    uint32_t val;
} extmem_level_split0_reg_t;

/** Type of level_split1 register
 *  USED TO SPLIT L1 CACHE AND L2 CACHE
 */
typedef union {
    struct {
        /** level_split1 : HRO; bitpos: [31:0]; default: 936;
         *  Reserved
         */
        uint32_t level_split1:32;
    };
    uint32_t val;
} extmem_level_split1_reg_t;


/** Group: L2 cache access attribute control register */
/** Type of l2_cache_access_attr_ctrl register
 *  L1 Cache access Attribute propagation control register
 */
typedef union {
    struct {
        /** l2_cache_access_force_cc : HRO; bitpos: [0]; default: 1;
         *  Set this bit to force the request to l2 cache with cacheable attribute, otherwise,
         *  the attribute is propagated from L1 cache or CPU, it could be one of cacheable and
         *  non-cacheable.
         */
        uint32_t l2_cache_access_force_cc:1;
        /** l2_cache_access_force_wb : HRO; bitpos: [1]; default: 1;
         *  Set this bit to force the request to l2 cache with write-back attribute, otherwise,
         *  the attribute is propagated from L1 cache or CPU, it could be one of write-back and
         *  write-through.
         */
        uint32_t l2_cache_access_force_wb:1;
        /** l2_cache_access_force_wma : HRO; bitpos: [2]; default: 1;
         *  Set this bit to force the request to l2 cache with write-miss-allocate attribute,
         *  otherwise, the attribute is propagated from L1 cache or CPU, it could be one of
         *  write-miss-allocate and write-miss-no-allocate.
         */
        uint32_t l2_cache_access_force_wma:1;
        /** l2_cache_access_force_rma : HRO; bitpos: [3]; default: 1;
         *  Set this bit to force the request to l2 cache with read-miss-allocate attribute,
         *  otherwise, the attribute is propagated from L1 cache or CPU, it could be one of
         *  read-miss-allocate and read-miss-no-allocate.
         */
        uint32_t l2_cache_access_force_rma:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} extmem_l2_cache_access_attr_ctrl_reg_t;


/** Group: Clock Gate Control and configuration register */
/** Type of clock_gate register
 *  Clock gate control register
 */
typedef union {
    struct {
        /** clk_en : R/W; bitpos: [0]; default: 1;
         *  The bit is used to enable clock gate when access all registers in this module.
         */
        uint32_t clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} extmem_clock_gate_reg_t;


/** Group: Redundancy  register (Prepare for ECO) */
/** Type of redundancy_sig0 register
 *  Cache redundancy signal 0 register
 */
typedef union {
    struct {
        /** cache_redcy_sig0 : R/W; bitpos: [31:0]; default: 0;
         *  Those bits are prepared for ECO.
         */
        uint32_t cache_redcy_sig0:32;
    };
    uint32_t val;
} extmem_redundancy_sig0_reg_t;

/** Type of redundancy_sig1 register
 *  Cache redundancy signal 1 register
 */
typedef union {
    struct {
        /** cache_redcy_sig1 : R/W; bitpos: [31:0]; default: 0;
         *  Those bits are prepared for ECO.
         */
        uint32_t cache_redcy_sig1:32;
    };
    uint32_t val;
} extmem_redundancy_sig1_reg_t;

/** Type of redundancy_sig2 register
 *  Cache redundancy signal 2 register
 */
typedef union {
    struct {
        /** cache_redcy_sig2 : R/W; bitpos: [31:0]; default: 0;
         *  Those bits are prepared for ECO.
         */
        uint32_t cache_redcy_sig2:32;
    };
    uint32_t val;
} extmem_redundancy_sig2_reg_t;

/** Type of redundancy_sig3 register
 *  Cache redundancy signal 3 register
 */
typedef union {
    struct {
        /** cache_redcy_sig3 : R/W; bitpos: [31:0]; default: 0;
         *  Those bits are prepared for ECO.
         */
        uint32_t cache_redcy_sig3:32;
    };
    uint32_t val;
} extmem_redundancy_sig3_reg_t;

/** Type of redundancy_sig4 register
 *  Cache redundancy signal 0 register
 */
typedef union {
    struct {
        /** cache_redcy_sig4 : RO; bitpos: [3:0]; default: 0;
         *  Those bits are prepared for ECO.
         */
        uint32_t cache_redcy_sig4:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} extmem_redundancy_sig4_reg_t;


/** Group: Version register */
/** Type of date register
 *  Version control register
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [27:0]; default: 35659904;
         *  version control register. Note that this default value stored is the latest date
         *  when the hardware logic was updated.
         */
        uint32_t date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} extmem_date_reg_t;


